ERP.belugaerp/src/Catalogs/Марки/Марки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Марки</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_БрендКУ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_БрендыКУ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_БрендМТ</name>
    <type>
      <types>CatalogRef.бг_ЕК_Бренды_БрендыМТ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_БрендТМ</name>
    <type>
      <types>CatalogRef.бг_ЕК_Бренды_БрендыТМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КатегорияБренда</name>
    <type>
      <types>CatalogRef.бг_ЕК_Бренды_КатегорииБренда</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КатегорияВладельца</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_КатегорияВладельца</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КатегорияМотивации</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_КатегорияМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНСИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПроектПЭО</name>
    <type>
      <types>CatalogRef.бг_ЕК_Бренды_ПроектыПЭО</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/Марки/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КодНСИ",
		, //Родитель
		"Объект.бг_КодНСИ");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КатегорияБренда",
		, //Родитель
		"Объект.бг_КатегорияБренда");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_Проект",
		, //Родитель
		"Объект.бг_Проект");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ПроектПЭО",
		, //Родитель
		"Объект.бг_ПроектПЭО");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_БрендТМ",
		, //Родитель
		"Объект.бг_БрендТМ");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_БрендМТ",
		, //Родитель
		"Объект.бг_БрендМТ");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_БрендКУ",
		, //Родитель
		"Объект.бг_БрендКУ");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КатегорияМотивации",
		, //Родитель
		"Объект.бг_КатегорияМотивации");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КатегорияВладельца",
		, //Родитель
		"Объект.бг_КатегорияВладельца");
	
КонецПроцедуры

#КонецОбласти
